; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=16, remove_proportion=0.2, bases=3, instance_id=6, output=./training, seed=47

(define (problem warehouse-06)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 - box
        base1 base2 base3 - base
    )
    (:init
        (to-remove box2)
        (to-remove box7)
        (to-remove box12)
        (clear box13)
        (on box13 box10)
        (on box10 box14)
        (on box14 box15)
        (on-base box15 base1)
        (clear box4)
        (on box4 box11)
        (on box11 box2)
        (on box2 box7)
        (on box7 box8)
        (on box8 box5)
        (on box5 box16)
        (on-base box16 base2)
        (clear box9)
        (on box9 box1)
        (on box1 box3)
        (on box3 box6)
        (on box6 box12)
        (on-base box12 base3)
    )
    (:goal (and 
        (removed box2)
        (removed box7)
        (removed box12)
    ))
)

; plan
1. (move box4 box11 box13)
   deleted: (clear box13) (on box4 box11)
   added: (on box4 box13) (clear box11)
   goals met: 0 of 3
2. (move box11 box2 box4)
   deleted: (clear box4) (on box11 box2)
   added: (on box11 box4) (clear box2)
   goals met: 0 of 3
3. (move box9 box1 box11)
   deleted: (clear box11) (on box9 box1)
   added: (on box9 box11) (clear box1)
   goals met: 0 of 3
4. (remove box2 box7)
   deleted: (on box2 box7) (clear box2)
   added: (removed box2) (clear box7)
   goals met: 1 of 3
5. (remove box7 box8)
   deleted: (on box7 box8) (clear box7)
   added: (removed box7) (clear box8)
   goals met: 2 of 3
6. (move box1 box3 box8)
   deleted: (clear box8) (on box1 box3)
   added: (on box1 box8) (clear box3)
   goals met: 2 of 3
7. (move box3 box6 box1)
   deleted: (clear box1) (on box3 box6)
   added: (on box3 box1) (clear box6)
   goals met: 2 of 3
8. (move box6 box12 box3)
   deleted: (clear box3) (on box6 box12)
   added: (on box6 box3) (clear box12)
   goals met: 2 of 3
9. (remove-from-base box12 base3)
   deleted: (on-base box12 base3) (clear box12)
   added: (removed box12) (clear-base base3)
   goals met: 3 of 3
